## Examen databanken - praktijk

Vooraleer je start: lees de sakila databank in.  Pas indien nodig de user aan.  Zorg dat je kan connecteren op je databank, en maak telkens de query die nodig is om de vraag op te lossen.  Voer dus je queries niet rechtstreeks in PGAdmin in, maar hier zodat ik jouw queries en het resultaat ervan kan zien.

In [2]:
# Connectie op de database

import psycopg2

# Verbinding maken
# Database connection parameters
conn = psycopg2.connect(
    dbname="sakila",  # of jouw database naam
    user="admin",  # standaard postgres gebruiker
    password="myPasswww00rD",  # wachtwoord dat je hebt ingesteld in de compose file
    host="mypostgres",  # de containernaam in het netwerk is de host
    port="5432"  # standaard PostgreSQL-poort
)

In [3]:
cur = conn.cursor()

In [4]:
import pandas as pd
from sqlalchemy import create_engine
database_url = "postgresql+psycopg2://admin:myPasswww00rD@mypostgres:5432/sakila"

In [12]:
# Hieronder kan je een eerste query uitvoeren.  

query = """
SELECT COUNT(*) FROM actor;
"""

In [13]:
df = pd.read_sql_query(query, database_url)

In [19]:
if df['count'][0] == 200:
    print("Good to go!")
else:
    print("Not yet there...")

Good to go!

## Opdrachten

### 1. **Maken van een view**
**Opdracht:** Maak een view genaamd `customer_info` die de voornaam, achternaam, en e-mail van klanten toont.

In [22]:
query = """
CREATE VIEW customer_info AS
SELECT first_name, last_name, email
FROM customer;
"""

cur.execute(query)
# Commit de transactie
conn.commit()

In [25]:
# Voer onderstaande query uit om na te gaan of jouw view correct werkt
query = "SELECT * FROM customer_info LIMIT 5;"

df = pd.read_sql_query(query, database_url)
df.head()

  first_name last_name                               email
0       MARY     SMITH        MARY.SMITH@admincustomer.org
1   PATRICIA   JOHNSON  PATRICIA.JOHNSON@admincustomer.org
2      LINDA  WILLIAMS    LINDA.WILLIAMS@admincustomer.org
3    BARBARA     JONES     BARBARA.JONES@admincustomer.org
4  ELIZABETH     BROWN   ELIZABETH.BROWN@admincustomer.org

### 2. **Tellen...**
**Opdracht:** Hoeveel unieke landennamen zijn aanwezig in de tabel `country`?

In [29]:
query = """
SELECT COUNT(DISTINCT country)
FROM country;"""

df = pd.read_sql_query(query, database_url)
df.head()

   count
0    109

### 3. **Insert, Update en Delete**
**Opdracht:** Voeg een nieuwe film toe, wijzig de beschrijving ervan, en verwijder deze vervolgens.

In [31]:
# Insert Query:
query = """
INSERT INTO film (title, description, language_id, rental_duration, rental_rate, replacement_cost)
VALUES ('Nieuw Film', 'Een spannende film.', 1, 7, 3.99, 15.99);
"""

In [32]:
# Update Query:
query = """
UPDATE film
SET description = 'Een ge√ºpdatete beschrijving.'
WHERE title = 'Nieuw Film';
"""

In [33]:
# Delete Query:
query = """
DELETE FROM film
WHERE title = 'Nieuw Film';
"""

### 4. Filteren
**Opdracht:** Haal alle steden op die beginnen met een 'A' en minimaal 5 karakters bevatten.

In [36]:
query = """
SELECT city
FROM city
WHERE city LIKE 'A____%%';
"""

In [39]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Aantal gevonden steden: {df.shape[0]}")
df.head()

Aantal gevonden steden: 34

                 city
0  A Corua (La Corua)
1           Abu Dhabi
2               Adana
3         Addis Abeba
4               Adoni

### 5. **Toon voor alle klanten de naam van hun stad**

In [40]:
query = """
SELECT customer.first_name, customer.last_name, city.city
FROM customer
INNER JOIN address ON customer.address_id = address.address_id
INNER JOIN city ON address.city_id = city.city_id;
"""

In [42]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Aantal gevonden klanten: {df.shape[0]}")
df.head()

Aantal gevonden klanten: 599

  first_name last_name            city
0       MARY     SMITH          Sasebo
1   PATRICIA   JOHNSON  San Bernardino
2      LINDA  WILLIAMS         Athenai
3    BARBARA     JONES        Myingyan
4  ELIZABETH     BROWN          Nantou

### 6. Toon alle adressen, zelfs als er geen bijbehorende klant is.

In [43]:
query = """
SELECT address.address, customer.first_name
FROM address
LEFT JOIN customer ON address.address_id = customer.address_id;
"""

In [44]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Aantal gevonden adressen: {df.shape[0]}")
df.head()

Aantal gevonden adressen: 603

             address first_name
0     1913 Hanoi Way       MARY
1   1121 Loja Avenue   PATRICIA
2  692 Joliet Street      LINDA
3   1566 Inegl Manor    BARBARA
4    53 Idfu Parkway  ELIZABETH

### 7. Maak een combinatie van alle mogelijke films en categorie√´n.

In [45]:
query = """
SELECT film.title, category.name
FROM film
CROSS JOIN category;
"""

In [46]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Aantal gevonden combinaties: {df.shape[0]}")
df.head()

Aantal gevonden combinaties: 16000

              title       name
0  ACADEMY DINOSAUR     Action
1  ACADEMY DINOSAUR  Animation
2  ACADEMY DINOSAUR   Children
3  ACADEMY DINOSAUR   Classics
4  ACADEMY DINOSAUR     Comedy

### 8. **Set-operaties**
**Opdracht:** Haal alle voornamen van klanten **en** medewerkers op, *zonder dubbele namen*.

In [47]:
query = """
SELECT first_name
FROM customer
UNION
SELECT first_name
FROM staff;
"""

In [48]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Aantal gevonden voornamen: {df.shape[0]}")
df.head()

Aantal gevonden voornamen: 593

  first_name
0    RANDALL
1      PETER
2      ALLEN
3     BONNIE
4     MARTHA

### 9. **Toon de top 5 meest verhuurde films, inclusief het aantal keer ze werden verhuurd.**

In [49]:
query = """
SELECT title, rental_count
FROM (
    SELECT film.title, COUNT(rental.rental_id) AS rental_count
    FROM film
    INNER JOIN inventory ON film.film_id = inventory.film_id
    INNER JOIN rental ON inventory.inventory_id = rental.inventory_id
    GROUP BY film.title
) AS subquery
ORDER BY rental_count DESC
LIMIT 5;
"""

In [52]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"5 meest verhuurde films:")
df.head()

5 meest verhuurde films:

                 title  rental_count
0   BUCKET BROTHERHOOD            34
1     ROCKETEER MOTHER            33
2  RIDGEMONT SUBMARINE            32
3        SCALAWAG DUCK            32
4       FORWARD TEMPLE            32

### 10. **Bereken de gemiddelde lengte van films, afgerond op tientallen.**

In [53]:
query = """
SELECT ROUND(AVG(length), -1) AS gemiddelde_lengte
FROM film;
"""

In [55]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Gemiddelde lengte van films, afgerond op tientallen:")
df.head()

Gemiddelde lengte van films, afgerond op tientallen:

   gemiddelde_lengte
0              120.0

### 11. **Toon alle films, gesorteerd op lengte (DESC) en titel (ASC).**

In [56]:
query = """
SELECT title, length
FROM film
ORDER BY length DESC, title ASC;
"""

In [59]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Alle films, gesorteerd op lengte (DESC) en titel (ASC) (Aantal:{df.shape[0]}):")
df.head()

Alle films, gesorteerd op lengte (DESC) en titel (ASC) (Aantal:1000):

            title  length
0   CHICAGO NORTH     185
1  CONTROL ANTHEM     185
2  DARN FORRESTER     185
3     GANGS PRIDE     185
4       HOME PITY     185

### 12. **Toon het aantal films per taal.**

In [62]:
query = """
SELECT language.name AS taal, COUNT(film.film_id) AS aantal_films
FROM film
INNER JOIN language ON film.language_id = language.language_id
GROUP BY language.name;
"""

In [63]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
df.head()

                   taal  aantal_films
0  English                       1000

### 13. **Toon categorie√´n met meer dan 10 films.**

In [64]:
query = """
SELECT category.name AS categorie, COUNT(film_category.film_id) AS aantal_films
FROM category
INNER JOIN film_category ON category.category_id = film_category.category_id
GROUP BY category.name
HAVING COUNT(film_category.film_id) > 10;
"""

In [66]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
print(f"Het aantal categorie√´n met meer dan 10 films: {df.shape[0]}")
df.head()

Het aantal categorie√´n met meer dan 10 films: 16

     categorie  aantal_films
0       Family            69
1        Games            61
2    Animation            66
3     Classics            57
4  Documentary            68

### 14. **Triggers en Trigger Functions**
**Opdracht:** Maak een trigger die automatisch de huurprijs van een film berekent bij een `INSERT`.  Neem een huurprijs die overeenkomst met 20% van de replacement_cost.

**Trigger Function:**
```sql
CREATE OR REPLACE FUNCTION calculate_rental_rate()
RETURNS TRIGGER AS $$
BEGIN
    NEW.rental_rate := NEW.replacement_cost * 0.2;
    RETURN NEW;
END;
$$ LANGUAGE plpgsql;
```

**Trigger:**
```sql
CREATE TRIGGER set_rental_rate
BEFORE INSERT ON film
FOR EACH ROW
EXECUTE FUNCTION calculate_rental_rate();
```

In [71]:
# Check
query = """
INSERT INTO film (title, description, release_year, language_id, rental_duration, replacement_cost, length)
VALUES ('Nieuwe Film', 'Beschrijving van de film', 2025, 1, 7, 50.00, 120);
"""
cur.execute(query)
# Commit de transactie
conn.commit()

In [72]:
query = """
SELECT rental_rate / replacement_cost AS rental_to_replacement_ratio
FROM film
WHERE title = 'Nieuwe Film';
"""

In [74]:
# Voer deze code uit met jouw query
df = pd.read_sql_query(query, database_url)
if df['rental_to_replacement_ratio'][0] == 0.2:
    print("Yes")
else:
    print("Try again")

Yes